zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_BASE.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_NETC_SW_BASE.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_NETC_SW_BASE
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_NETC_SW_BASE_H_)  /* Check if memory map has not been already included */
#define S32K566_NETC_SW_BASE_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- NETC_SW_BASE Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_SW_BASE_Peripheral_Access_Layer NETC_SW_BASE Peripheral Access Layer
 * @{
 */

/** NETC_SW_BASE - Size of Registers Arrays */
#define NETC_SW_BASE_NUM_PORT_GRP_COUNT           1u
#define NETC_SW_BASE_NUM_CBDR_COUNT               2u
#define NETC_SW_BASE_NUM_CBDR_INT_COUNT           2u
#define NETC_SW_BASE_MAP_PCP_MAP_IPV_COUNT        4u
#define NETC_SW_BASE_MAP_PCP_COUNT                2u
#define NETC_SW_BASE_NUM_PCP2PCPMPR_COUNT         2u

/** NETC_SW_BASE - Register Layout Typedef */
typedef struct NETC_SW_BASE_Struct {
  __I  uint32_t SCAPR0;                            /**< Switch capability register 0, offset: 0x0 */
  __I  uint32_t SCAPR1;                            /**< Switch capability register 1, offset: 0x4 */
  __I  uint32_t BPCAPR;                            /**< Buffer pool capability register, offset: 0x8 */
  uint8_t RESERVED_0[12];
  __I  uint32_t FCAPR;                             /**< Forwarding capability register, offset: 0x18 */
  uint8_t RESERVED_1[36];
  __I  uint32_t SMBCAPR;                           /**< Shared memory buffer capability register, offset: 0x40 */
  __I  uint32_t SMBOR0;                            /**< Shared memory buffer operational register 0, offset: 0x44 */
  __I  uint32_t SMBOR1;                            /**< Shared memory buffer operational register 1, offset: 0x48 */
  uint8_t RESERVED_2[52];
  __IO uint32_t CCAR;                              /**< Command cache attribute register, offset: 0x80 */
  uint8_t RESERVED_3[124];
  __I  uint32_t BPTCAPR;                           /**< Buffer pool table capability register, offset: 0x100 */
  __I  uint32_t SBPTCAPR;                          /**< Shared buffer pool table capability register, offset: 0x104 */
  uint8_t RESERVED_4[8];
  __I  uint32_t ETMCGTCAPR;                        /**< ETM congestion group table capability register, offset: 0x110 */
  __I  uint32_t ETMCQTCAPR;                        /**< ETM class queue table capability register, offset: 0x114 */
  __I  uint32_t ETMCSTCAPR;                        /**< ETM class scheduler table capability register, offset: 0x118 */
  uint8_t RESERVED_5[4];
  __I  uint32_t ATSQSCAPR;                         /**< ATS queue set capability register, offset: 0x120 */
  __I  uint32_t ATSQSOR;                           /**< ATS queue set operational register, offset: 0x124 */
  __IO uint32_t ATSCR;                             /**< ATS configuration register, offset: 0x128 */
  uint8_t RESERVED_6[596];
  __I  uint32_t SWID0PMR;                          /**< Switch ID 0 to port mapping register, offset: 0x380 */
  uint8_t RESERVED_7[124];
  __I  uint32_t PGCAPR;                            /**< Port group capability register, offset: 0x400 */
  __I  uint32_t PGOR[NETC_SW_BASE_NUM_PORT_GRP_COUNT]; /**< Port group 1 operational register, array offset: 0x404, array step: 0x4 */
  uint8_t RESERVED_8[24];
  __IO uint32_t IMDCR0;                            /**< Ingress mirror destination configuration register 0, offset: 0x420 */
  __IO uint32_t IMDCR1;                            /**< Ingress mirror destination configuration register 1, offset: 0x424 */
  uint8_t RESERVED_9[24];
  __IO uint32_t CTFCR;                             /**< Cut-through forwarding count register, offset: 0x440 */
  uint8_t RESERVED_10[956];
  struct NETC_SW_BASE_NUM_CBDR {                   /* offset: 0x800, array step: 0x30 */
    __IO uint32_t CBDRMR;                            /**< Command BDR 0 mode register..Command BDR 1 mode register, array offset: 0x800, array step: 0x30 */
    __I  uint32_t CBDRSR;                            /**< Command BDR 0 status register..Command BDR 1 status register, array offset: 0x804, array step: 0x30 */
    uint8_t RESERVED_0[8];
    __IO uint32_t CBDRBAR0;                          /**< Command BDR base address register 0, array offset: 0x810, array step: 0x30 */
    __IO uint32_t CBDRBAR1;                          /**< Command BDR 0 base address register 1..Command BDR 1 base address register 1, array offset: 0x814, array step: 0x30 */
    __IO uint32_t CBDRPIR;                           /**< Command BDR 0 producer index register..Command BDR 1 producer index register, array offset: 0x818, array step: 0x30 */
    __IO uint32_t CBDRCIR;                           /**< Command BDR 0 consumer index register..Command BDR 1 consumer index register, array offset: 0x81C, array step: 0x30 */
    __IO uint32_t CBDRLENR;                          /**< Command BDR 0 length register..Command BDR 1 length register, array offset: 0x820, array step: 0x30 */
    uint8_t RESERVED_1[12];
  } NUM_CBDR[NETC_SW_BASE_NUM_CBDR_COUNT];
  uint8_t RESERVED_11[64];
  struct NETC_SW_BASE_NUM_CBDR_INT {               /* offset: 0x8A0, array step: 0x10 */
    __IO uint32_t CBDRIER;                           /**< Command BDR 0 interrupt enable register..Command BDR 1 interrupt enable register, array offset: 0x8A0, array step: 0x10 */
    __IO uint32_t CBDRIDR;                           /**< Command BDR 0 interrupt detect register..Command BDR 1 interrupt detect register, array offset: 0x8A4, array step: 0x10 */
    __IO uint32_t CBDRMSIVR;                         /**< Command BDR 0 MSI-X vector register..Command BDR 1 MSI-X vector register, array offset: 0x8A8, array step: 0x10 */
    uint8_t RESERVED_0[4];
  } NUM_CBDR_INT[NETC_SW_BASE_NUM_CBDR_INT_COUNT];
  uint8_t RESERVED_12[64];
  struct NETC_SW_BASE_MAP_PCP {                    /* offset: 0x900, array step: 0x20 */
    __IO uint32_t QOSVLANMPR[NETC_SW_BASE_MAP_PCP_MAP_IPV_COUNT];   /**< QoS to VLAN mapping profile 0 register 0..QoS to VLAN mapping profile 1 register 3, array offset: 0x900, array step: index*0x20, index2*0x4 */
    uint8_t RESERVED_0[16];
  } MAP_PCP[NETC_SW_BASE_MAP_PCP_COUNT];
  uint8_t RESERVED_13[448];
  __IO uint32_t PCP2PCPMPR[NETC_SW_BASE_NUM_PCP2PCPMPR_COUNT]; /**< PCP to PCP mapping profile 0 register..PCP to PCP mapping profile 1 register, array offset: 0xB00, array step: 0x4 */
  uint8_t RESERVED_14[5368];
  __I  uint32_t BRCAPR;                            /**< Bridge capability register, offset: 0x2000 */
  uint8_t RESERVED_15[4];
  __I  uint32_t VFHTCAPR;                          /**< VLAN filter hash table capability register, offset: 0x2008 */
  __I  uint32_t VFHTOR;                            /**< VLAN filter hash table operational register, offset: 0x200C */
  __IO uint32_t VFHTDECR0;                         /**< VLAN Filter (hash) table default entry configuration registers 0, offset: 0x2010 */
  __IO uint32_t VFHTDECR1;                         /**< VLAN filter hash table default entry configuration registers 1, offset: 0x2014 */
  __IO uint32_t VFHTDECR2;                         /**< VLAN filter hash table default entry configuration registers 2, offset: 0x2018 */
  uint8_t RESERVED_16[4];
  __I  uint32_t FDBHTCAPR;                         /**< FDB hash table capability register, offset: 0x2020 */
  __IO uint32_t FDBHTMCR;                          /**< FDB hash table memory configuration register, offset: 0x2024 */
  __I  uint32_t FDBHTOR0;                          /**< FDB hash table operational register 0, offset: 0x2028 */
  __I  uint32_t FDBHTOR1;                          /**< FDB hash table operational register 1, offset: 0x202C */
  uint8_t RESERVED_17[16];
  __I  uint32_t IPMFHTCAPR;                        /**< IP multicast filter hash table capability register, offset: 0x2040 */
  __I  uint32_t IPV4MFHTOR;                        /**< IPv4 multicast filter hash table operation register, offset: 0x2044 */
} NETC_SW_BASE_Type, *NETC_SW_BASE_MemMapPtr;

/** Number of instances of the NETC_SW_BASE module. */
#define NETC_SW_BASE_INSTANCE_COUNT              (1u)

