zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_BASE.h
/* NETC_SW_BASE - Peripheral instance base addresses */
/** Peripheral NETC__SW0_BASE base address */
#define IP_NETC__SW0_BASE_BASE                   (0x6D000000u)
/** Peripheral NETC__SW0_BASE base pointer */
#define IP_NETC__SW0_BASE                        ((NETC_SW_BASE_Type *)IP_NETC__SW0_BASE_BASE)
/** Array initializer of NETC_SW_BASE peripheral base addresses */
#define IP_NETC_SW_BASE_BASE_ADDRS               { IP_NETC__SW0_BASE_BASE }
/** Array initializer of NETC_SW_BASE peripheral base pointers */
#define IP_NETC_SW_BASE_BASE_PTRS                { IP_NETC__SW0_BASE }

/* ----------------------------------------------------------------------------
   -- NETC_SW_BASE Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_SW_BASE_Register_Masks NETC_SW_BASE Register Masks
 * @{
 */

/*! @name SCAPR0 - Switch capability register 0 */
/*! @{ */

#define NETC_SW_BASE_SCAPR0_NUM_PORT_MASK        (0x1FU)
#define NETC_SW_BASE_SCAPR0_NUM_PORT_SHIFT       (0U)
#define NETC_SW_BASE_SCAPR0_NUM_PORT_WIDTH       (5U)
#define NETC_SW_BASE_SCAPR0_NUM_PORT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR0_NUM_PORT_SHIFT)) & NETC_SW_BASE_SCAPR0_NUM_PORT_MASK)

#define NETC_SW_BASE_SCAPR0_NUM_IPV_MASK         (0x100U)
#define NETC_SW_BASE_SCAPR0_NUM_IPV_SHIFT        (8U)
#define NETC_SW_BASE_SCAPR0_NUM_IPV_WIDTH        (1U)
#define NETC_SW_BASE_SCAPR0_NUM_IPV(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR0_NUM_IPV_SHIFT)) & NETC_SW_BASE_SCAPR0_NUM_IPV_MASK)

#define NETC_SW_BASE_SCAPR0_NUM_MSIX_MASK        (0xF0000U)
#define NETC_SW_BASE_SCAPR0_NUM_MSIX_SHIFT       (16U)
#define NETC_SW_BASE_SCAPR0_NUM_MSIX_WIDTH       (4U)
#define NETC_SW_BASE_SCAPR0_NUM_MSIX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR0_NUM_MSIX_SHIFT)) & NETC_SW_BASE_SCAPR0_NUM_MSIX_MASK)

#define NETC_SW_BASE_SCAPR0_NUM_PCPMP_MASK       (0xF00000U)
#define NETC_SW_BASE_SCAPR0_NUM_PCPMP_SHIFT      (20U)
#define NETC_SW_BASE_SCAPR0_NUM_PCPMP_WIDTH      (4U)
#define NETC_SW_BASE_SCAPR0_NUM_PCPMP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR0_NUM_PCPMP_SHIFT)) & NETC_SW_BASE_SCAPR0_NUM_PCPMP_MASK)

#define NETC_SW_BASE_SCAPR0_NUM_QVMP_MASK        (0xF000000U)
#define NETC_SW_BASE_SCAPR0_NUM_QVMP_SHIFT       (24U)
#define NETC_SW_BASE_SCAPR0_NUM_QVMP_WIDTH       (4U)
#define NETC_SW_BASE_SCAPR0_NUM_QVMP(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR0_NUM_QVMP_SHIFT)) & NETC_SW_BASE_SCAPR0_NUM_QVMP_MASK)
/*! @} */

/*! @name SCAPR1 - Switch capability register 1 */
/*! @{ */

#define NETC_SW_BASE_SCAPR1_FS_MASK              (0x1U)
#define NETC_SW_BASE_SCAPR1_FS_SHIFT             (0U)
#define NETC_SW_BASE_SCAPR1_FS_WIDTH             (1U)
#define NETC_SW_BASE_SCAPR1_FS(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR1_FS_SHIFT)) & NETC_SW_BASE_SCAPR1_FS_MASK)

#define NETC_SW_BASE_SCAPR1_CTF_MASK             (0x4U)
#define NETC_SW_BASE_SCAPR1_CTF_SHIFT            (2U)
#define NETC_SW_BASE_SCAPR1_CTF_WIDTH            (1U)
#define NETC_SW_BASE_SCAPR1_CTF(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR1_CTF_SHIFT)) & NETC_SW_BASE_SCAPR1_CTF_MASK)

#define NETC_SW_BASE_SCAPR1_TIMCAP_MASK          (0x8U)
#define NETC_SW_BASE_SCAPR1_TIMCAP_SHIFT         (3U)
#define NETC_SW_BASE_SCAPR1_TIMCAP_WIDTH         (1U)
#define NETC_SW_BASE_SCAPR1_TIMCAP(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR1_TIMCAP_SHIFT)) & NETC_SW_BASE_SCAPR1_TIMCAP_MASK)

#define NETC_SW_BASE_SCAPR1_IMIR_MASK            (0x10U)
#define NETC_SW_BASE_SCAPR1_IMIR_SHIFT           (4U)
#define NETC_SW_BASE_SCAPR1_IMIR_WIDTH           (1U)
#define NETC_SW_BASE_SCAPR1_IMIR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR1_IMIR_SHIFT)) & NETC_SW_BASE_SCAPR1_IMIR_MASK)

#define NETC_SW_BASE_SCAPR1_PG_MASK              (0x40U)
#define NETC_SW_BASE_SCAPR1_PG_SHIFT             (6U)
#define NETC_SW_BASE_SCAPR1_PG_WIDTH             (1U)
#define NETC_SW_BASE_SCAPR1_PG(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR1_PG_SHIFT)) & NETC_SW_BASE_SCAPR1_PG_MASK)

#define NETC_SW_BASE_SCAPR1_SDF_MASK             (0x80U)
#define NETC_SW_BASE_SCAPR1_SDF_SHIFT            (7U)
#define NETC_SW_BASE_SCAPR1_SDF_WIDTH            (1U)
#define NETC_SW_BASE_SCAPR1_SDF(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR1_SDF_SHIFT)) & NETC_SW_BASE_SCAPR1_SDF_MASK)

#define NETC_SW_BASE_SCAPR1_SWA_MASK             (0x300U)
#define NETC_SW_BASE_SCAPR1_SWA_SHIFT            (8U)
#define NETC_SW_BASE_SCAPR1_SWA_WIDTH            (2U)
#define NETC_SW_BASE_SCAPR1_SWA(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR1_SWA_SHIFT)) & NETC_SW_BASE_SCAPR1_SWA_MASK)

#define NETC_SW_BASE_SCAPR1_ATS_MASK             (0x400U)
#define NETC_SW_BASE_SCAPR1_ATS_SHIFT            (10U)
#define NETC_SW_BASE_SCAPR1_ATS_WIDTH            (1U)
#define NETC_SW_BASE_SCAPR1_ATS(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR1_ATS_SHIFT)) & NETC_SW_BASE_SCAPR1_ATS_MASK)

#define NETC_SW_BASE_SCAPR1_SQ_TAGS_MASK         (0x1F0000U)
#define NETC_SW_BASE_SCAPR1_SQ_TAGS_SHIFT        (16U)
#define NETC_SW_BASE_SCAPR1_SQ_TAGS_WIDTH        (5U)
#define NETC_SW_BASE_SCAPR1_SQ_TAGS(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SCAPR1_SQ_TAGS_SHIFT)) & NETC_SW_BASE_SCAPR1_SQ_TAGS_MASK)
/*! @} */

/*! @name BPCAPR - Buffer pool capability register */
/*! @{ */

#define NETC_SW_BASE_BPCAPR_NUM_BP_MASK          (0xFFU)
#define NETC_SW_BASE_BPCAPR_NUM_BP_SHIFT         (0U)
#define NETC_SW_BASE_BPCAPR_NUM_BP_WIDTH         (8U)
#define NETC_SW_BASE_BPCAPR_NUM_BP(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_BPCAPR_NUM_BP_SHIFT)) & NETC_SW_BASE_BPCAPR_NUM_BP_MASK)

#define NETC_SW_BASE_BPCAPR_NUM_SBP_MASK         (0x1F0000U)
#define NETC_SW_BASE_BPCAPR_NUM_SBP_SHIFT        (16U)
#define NETC_SW_BASE_BPCAPR_NUM_SBP_WIDTH        (5U)
#define NETC_SW_BASE_BPCAPR_NUM_SBP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_BPCAPR_NUM_SBP_SHIFT)) & NETC_SW_BASE_BPCAPR_NUM_SBP_MASK)
/*! @} */

/*! @name FCAPR - Forwarding capability register */
/*! @{ */

#define NETC_SW_BASE_FCAPR_BR_MASK               (0x1U)
#define NETC_SW_BASE_FCAPR_BR_SHIFT              (0U)
#define NETC_SW_BASE_FCAPR_BR_WIDTH              (1U)
#define NETC_SW_BASE_FCAPR_BR(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_FCAPR_BR_SHIFT)) & NETC_SW_BASE_FCAPR_BR_MASK)

#define NETC_SW_BASE_FCAPR_SF_MASK               (0x2U)
#define NETC_SW_BASE_FCAPR_SF_SHIFT              (1U)
#define NETC_SW_BASE_FCAPR_SF_WIDTH              (1U)
#define NETC_SW_BASE_FCAPR_SF(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_FCAPR_SF_SHIFT)) & NETC_SW_BASE_FCAPR_SF_MASK)
/*! @} */

