zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_BASE.h
/*! @name SMBCAPR - Shared memory buffer capability register */
/*! @{ */

#define NETC_SW_BASE_SMBCAPR_NUM_WORDS_MASK      (0xFFFFFFU)
#define NETC_SW_BASE_SMBCAPR_NUM_WORDS_SHIFT     (0U)
#define NETC_SW_BASE_SMBCAPR_NUM_WORDS_WIDTH     (24U)
#define NETC_SW_BASE_SMBCAPR_NUM_WORDS(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SMBCAPR_NUM_WORDS_SHIFT)) & NETC_SW_BASE_SMBCAPR_NUM_WORDS_MASK)

#define NETC_SW_BASE_SMBCAPR_WORD_SIZE_MASK      (0x30000000U)
#define NETC_SW_BASE_SMBCAPR_WORD_SIZE_SHIFT     (28U)
#define NETC_SW_BASE_SMBCAPR_WORD_SIZE_WIDTH     (2U)
#define NETC_SW_BASE_SMBCAPR_WORD_SIZE(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SMBCAPR_WORD_SIZE_SHIFT)) & NETC_SW_BASE_SMBCAPR_WORD_SIZE_MASK)

#define NETC_SW_BASE_SMBCAPR_MLOC_MASK           (0xC0000000U)
#define NETC_SW_BASE_SMBCAPR_MLOC_SHIFT          (30U)
#define NETC_SW_BASE_SMBCAPR_MLOC_WIDTH          (2U)
#define NETC_SW_BASE_SMBCAPR_MLOC(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SMBCAPR_MLOC_SHIFT)) & NETC_SW_BASE_SMBCAPR_MLOC_MASK)
/*! @} */

/*! @name SMBOR0 - Shared memory buffer operational register 0 */
/*! @{ */

#define NETC_SW_BASE_SMBOR0_COUNT_MASK           (0xFFFFFFU)
#define NETC_SW_BASE_SMBOR0_COUNT_SHIFT          (0U)
#define NETC_SW_BASE_SMBOR0_COUNT_WIDTH          (24U)
#define NETC_SW_BASE_SMBOR0_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SMBOR0_COUNT_SHIFT)) & NETC_SW_BASE_SMBOR0_COUNT_MASK)
/*! @} */

/*! @name SMBOR1 - Shared memory buffer operational register 1 */
/*! @{ */

#define NETC_SW_BASE_SMBOR1_WATERMARK_MASK       (0xFFFFFFU)
#define NETC_SW_BASE_SMBOR1_WATERMARK_SHIFT      (0U)
#define NETC_SW_BASE_SMBOR1_WATERMARK_WIDTH      (24U)
#define NETC_SW_BASE_SMBOR1_WATERMARK(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SMBOR1_WATERMARK_SHIFT)) & NETC_SW_BASE_SMBOR1_WATERMARK_MASK)
/*! @} */

/*! @name CCAR - Command cache attribute register */
/*! @{ */

#define NETC_SW_BASE_CCAR_CBD_WRCACHE_MASK       (0xFU)
#define NETC_SW_BASE_CCAR_CBD_WRCACHE_SHIFT      (0U)
#define NETC_SW_BASE_CCAR_CBD_WRCACHE_WIDTH      (4U)
#define NETC_SW_BASE_CCAR_CBD_WRCACHE(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CBD_WRCACHE_SHIFT)) & NETC_SW_BASE_CCAR_CBD_WRCACHE_MASK)

#define NETC_SW_BASE_CCAR_CBD_WRDOMAIN_MASK      (0x30U)
#define NETC_SW_BASE_CCAR_CBD_WRDOMAIN_SHIFT     (4U)
#define NETC_SW_BASE_CCAR_CBD_WRDOMAIN_WIDTH     (2U)
#define NETC_SW_BASE_CCAR_CBD_WRDOMAIN(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CBD_WRDOMAIN_SHIFT)) & NETC_SW_BASE_CCAR_CBD_WRDOMAIN_MASK)

#define NETC_SW_BASE_CCAR_CBD_WRSNP_MASK         (0xC0U)
#define NETC_SW_BASE_CCAR_CBD_WRSNP_SHIFT        (6U)
#define NETC_SW_BASE_CCAR_CBD_WRSNP_WIDTH        (2U)
#define NETC_SW_BASE_CCAR_CBD_WRSNP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CBD_WRSNP_SHIFT)) & NETC_SW_BASE_CCAR_CBD_WRSNP_MASK)

#define NETC_SW_BASE_CCAR_CWRCACHE_MASK          (0xF00U)
#define NETC_SW_BASE_CCAR_CWRCACHE_SHIFT         (8U)
#define NETC_SW_BASE_CCAR_CWRCACHE_WIDTH         (4U)
#define NETC_SW_BASE_CCAR_CWRCACHE(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CWRCACHE_SHIFT)) & NETC_SW_BASE_CCAR_CWRCACHE_MASK)

#define NETC_SW_BASE_CCAR_CWRDOMAIN_MASK         (0x3000U)
#define NETC_SW_BASE_CCAR_CWRDOMAIN_SHIFT        (12U)
#define NETC_SW_BASE_CCAR_CWRDOMAIN_WIDTH        (2U)
#define NETC_SW_BASE_CCAR_CWRDOMAIN(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CWRDOMAIN_SHIFT)) & NETC_SW_BASE_CCAR_CWRDOMAIN_MASK)

#define NETC_SW_BASE_CCAR_CWRSNP_MASK            (0xC000U)
#define NETC_SW_BASE_CCAR_CWRSNP_SHIFT           (14U)
#define NETC_SW_BASE_CCAR_CWRSNP_WIDTH           (2U)
#define NETC_SW_BASE_CCAR_CWRSNP(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CWRSNP_SHIFT)) & NETC_SW_BASE_CCAR_CWRSNP_MASK)

#define NETC_SW_BASE_CCAR_CBD_RDCACHE_MASK       (0xF0000U)
#define NETC_SW_BASE_CCAR_CBD_RDCACHE_SHIFT      (16U)
#define NETC_SW_BASE_CCAR_CBD_RDCACHE_WIDTH      (4U)
#define NETC_SW_BASE_CCAR_CBD_RDCACHE(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CBD_RDCACHE_SHIFT)) & NETC_SW_BASE_CCAR_CBD_RDCACHE_MASK)

#define NETC_SW_BASE_CCAR_CBD_RDDOMAIN_MASK      (0x300000U)
#define NETC_SW_BASE_CCAR_CBD_RDDOMAIN_SHIFT     (20U)
#define NETC_SW_BASE_CCAR_CBD_RDDOMAIN_WIDTH     (2U)
#define NETC_SW_BASE_CCAR_CBD_RDDOMAIN(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CBD_RDDOMAIN_SHIFT)) & NETC_SW_BASE_CCAR_CBD_RDDOMAIN_MASK)

#define NETC_SW_BASE_CCAR_CBD_RDSNP_MASK         (0xC00000U)
#define NETC_SW_BASE_CCAR_CBD_RDSNP_SHIFT        (22U)
#define NETC_SW_BASE_CCAR_CBD_RDSNP_WIDTH        (2U)
#define NETC_SW_BASE_CCAR_CBD_RDSNP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CBD_RDSNP_SHIFT)) & NETC_SW_BASE_CCAR_CBD_RDSNP_MASK)

#define NETC_SW_BASE_CCAR_CRDCACHE_MASK          (0xF000000U)
#define NETC_SW_BASE_CCAR_CRDCACHE_SHIFT         (24U)
#define NETC_SW_BASE_CCAR_CRDCACHE_WIDTH         (4U)
#define NETC_SW_BASE_CCAR_CRDCACHE(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CRDCACHE_SHIFT)) & NETC_SW_BASE_CCAR_CRDCACHE_MASK)

#define NETC_SW_BASE_CCAR_CRDDOMAIN_MASK         (0x30000000U)
#define NETC_SW_BASE_CCAR_CRDDOMAIN_SHIFT        (28U)
#define NETC_SW_BASE_CCAR_CRDDOMAIN_WIDTH        (2U)
#define NETC_SW_BASE_CCAR_CRDDOMAIN(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CRDDOMAIN_SHIFT)) & NETC_SW_BASE_CCAR_CRDDOMAIN_MASK)

#define NETC_SW_BASE_CCAR_CRDSNP_MASK            (0xC0000000U)
#define NETC_SW_BASE_CCAR_CRDSNP_SHIFT           (30U)
#define NETC_SW_BASE_CCAR_CRDSNP_WIDTH           (2U)
#define NETC_SW_BASE_CCAR_CRDSNP(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CCAR_CRDSNP_SHIFT)) & NETC_SW_BASE_CCAR_CRDSNP_MASK)
/*! @} */

/*! @name BPTCAPR - Buffer pool table capability register */
/*! @{ */

#define NETC_SW_BASE_BPTCAPR_VERSIONS_MASK       (0xFFFF0000U)
#define NETC_SW_BASE_BPTCAPR_VERSIONS_SHIFT      (16U)
#define NETC_SW_BASE_BPTCAPR_VERSIONS_WIDTH      (16U)
#define NETC_SW_BASE_BPTCAPR_VERSIONS(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_BPTCAPR_VERSIONS_SHIFT)) & NETC_SW_BASE_BPTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name SBPTCAPR - Shared buffer pool table capability register */
/*! @{ */

