zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_BASE.h
#define NETC_SW_BASE_SBPTCAPR_VERSIONS_MASK      (0xFFFF0000U)
#define NETC_SW_BASE_SBPTCAPR_VERSIONS_SHIFT     (16U)
#define NETC_SW_BASE_SBPTCAPR_VERSIONS_WIDTH     (16U)
#define NETC_SW_BASE_SBPTCAPR_VERSIONS(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SBPTCAPR_VERSIONS_SHIFT)) & NETC_SW_BASE_SBPTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ETMCGTCAPR - ETM congestion group table capability register */
/*! @{ */

#define NETC_SW_BASE_ETMCGTCAPR_VERSIONS_MASK    (0xFFFF0000U)
#define NETC_SW_BASE_ETMCGTCAPR_VERSIONS_SHIFT   (16U)
#define NETC_SW_BASE_ETMCGTCAPR_VERSIONS_WIDTH   (16U)
#define NETC_SW_BASE_ETMCGTCAPR_VERSIONS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_ETMCGTCAPR_VERSIONS_SHIFT)) & NETC_SW_BASE_ETMCGTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ETMCQTCAPR - ETM class queue table capability register */
/*! @{ */

#define NETC_SW_BASE_ETMCQTCAPR_VERSIONS_MASK    (0xFFFF0000U)
#define NETC_SW_BASE_ETMCQTCAPR_VERSIONS_SHIFT   (16U)
#define NETC_SW_BASE_ETMCQTCAPR_VERSIONS_WIDTH   (16U)
#define NETC_SW_BASE_ETMCQTCAPR_VERSIONS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_ETMCQTCAPR_VERSIONS_SHIFT)) & NETC_SW_BASE_ETMCQTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ETMCSTCAPR - ETM class scheduler table capability register */
/*! @{ */

#define NETC_SW_BASE_ETMCSTCAPR_VERSIONS_MASK    (0xFFFF0000U)
#define NETC_SW_BASE_ETMCSTCAPR_VERSIONS_SHIFT   (16U)
#define NETC_SW_BASE_ETMCSTCAPR_VERSIONS_WIDTH   (16U)
#define NETC_SW_BASE_ETMCSTCAPR_VERSIONS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_ETMCSTCAPR_VERSIONS_SHIFT)) & NETC_SW_BASE_ETMCSTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ATSQSCAPR - ATS queue set capability register */
/*! @{ */

#define NETC_SW_BASE_ATSQSCAPR_NUM_ATS_QUEUE_SETS_MASK (0x3FU)
#define NETC_SW_BASE_ATSQSCAPR_NUM_ATS_QUEUE_SETS_SHIFT (0U)
#define NETC_SW_BASE_ATSQSCAPR_NUM_ATS_QUEUE_SETS_WIDTH (6U)
#define NETC_SW_BASE_ATSQSCAPR_NUM_ATS_QUEUE_SETS(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_ATSQSCAPR_NUM_ATS_QUEUE_SETS_SHIFT)) & NETC_SW_BASE_ATSQSCAPR_NUM_ATS_QUEUE_SETS_MASK)

#define NETC_SW_BASE_ATSQSCAPR_NUM_ATSQ_MASK     (0x1F00U)
#define NETC_SW_BASE_ATSQSCAPR_NUM_ATSQ_SHIFT    (8U)
#define NETC_SW_BASE_ATSQSCAPR_NUM_ATSQ_WIDTH    (5U)
#define NETC_SW_BASE_ATSQSCAPR_NUM_ATSQ(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_ATSQSCAPR_NUM_ATSQ_SHIFT)) & NETC_SW_BASE_ATSQSCAPR_NUM_ATSQ_MASK)
/*! @} */

/*! @name ATSQSOR - ATS queue set operational register */
/*! @{ */

#define NETC_SW_BASE_ATSQSOR_NUM_ATSQS_BOUND_MASK (0x3FU)
#define NETC_SW_BASE_ATSQSOR_NUM_ATSQS_BOUND_SHIFT (0U)
#define NETC_SW_BASE_ATSQSOR_NUM_ATSQS_BOUND_WIDTH (6U)
#define NETC_SW_BASE_ATSQSOR_NUM_ATSQS_BOUND(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_ATSQSOR_NUM_ATSQS_BOUND_SHIFT)) & NETC_SW_BASE_ATSQSOR_NUM_ATSQS_BOUND_MASK)
/*! @} */

/*! @name ATSCR - ATS configuration register */
/*! @{ */

#define NETC_SW_BASE_ATSCR_PDELAY_MASK           (0x3FFU)
#define NETC_SW_BASE_ATSCR_PDELAY_SHIFT          (0U)
#define NETC_SW_BASE_ATSCR_PDELAY_WIDTH          (10U)
#define NETC_SW_BASE_ATSCR_PDELAY(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_ATSCR_PDELAY_SHIFT)) & NETC_SW_BASE_ATSCR_PDELAY_MASK)
/*! @} */

/*! @name SWID0PMR - Switch ID 0 to port mapping register */
/*! @{ */

#define NETC_SW_BASE_SWID0PMR_PORT_MASK          (0x1FU)
#define NETC_SW_BASE_SWID0PMR_PORT_SHIFT         (0U)
#define NETC_SW_BASE_SWID0PMR_PORT_WIDTH         (5U)
#define NETC_SW_BASE_SWID0PMR_PORT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SWID0PMR_PORT_SHIFT)) & NETC_SW_BASE_SWID0PMR_PORT_MASK)

#define NETC_SW_BASE_SWID0PMR_VALID_MASK         (0x80000000U)
#define NETC_SW_BASE_SWID0PMR_VALID_SHIFT        (31U)
#define NETC_SW_BASE_SWID0PMR_VALID_WIDTH        (1U)
#define NETC_SW_BASE_SWID0PMR_VALID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_SWID0PMR_VALID_SHIFT)) & NETC_SW_BASE_SWID0PMR_VALID_MASK)
/*! @} */

/*! @name PGCAPR - Port group capability register */
/*! @{ */

#define NETC_SW_BASE_PGCAPR_NUM_PG_MASK          (0x7U)
#define NETC_SW_BASE_PGCAPR_NUM_PG_SHIFT         (0U)
#define NETC_SW_BASE_PGCAPR_NUM_PG_WIDTH         (3U)
#define NETC_SW_BASE_PGCAPR_NUM_PG(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_PGCAPR_NUM_PG_SHIFT)) & NETC_SW_BASE_PGCAPR_NUM_PG_MASK)
/*! @} */

/*! @name PGOR - Port group 1 operational register */
/*! @{ */

#define NETC_SW_BASE_PGOR_PORT_BITMAP_MASK       (0xFFFFFFU)
#define NETC_SW_BASE_PGOR_PORT_BITMAP_SHIFT      (0U)
#define NETC_SW_BASE_PGOR_PORT_BITMAP_WIDTH      (24U)
#define NETC_SW_BASE_PGOR_PORT_BITMAP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_PGOR_PORT_BITMAP_SHIFT)) & NETC_SW_BASE_PGOR_PORT_BITMAP_MASK)
/*! @} */

/*! @name IMDCR0 - Ingress mirror destination configuration register 0 */
/*! @{ */

#define NETC_SW_BASE_IMDCR0_MIREN_MASK           (0x1U)
#define NETC_SW_BASE_IMDCR0_MIREN_SHIFT          (0U)
#define NETC_SW_BASE_IMDCR0_MIREN_WIDTH          (1U)
#define NETC_SW_BASE_IMDCR0_MIREN(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_IMDCR0_MIREN_SHIFT)) & NETC_SW_BASE_IMDCR0_MIREN_MASK)

#define NETC_SW_BASE_IMDCR0_MIRDEST_MASK         (0x2U)
#define NETC_SW_BASE_IMDCR0_MIRDEST_SHIFT        (1U)
#define NETC_SW_BASE_IMDCR0_MIRDEST_WIDTH        (1U)
#define NETC_SW_BASE_IMDCR0_MIRDEST(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_IMDCR0_MIRDEST_SHIFT)) & NETC_SW_BASE_IMDCR0_MIRDEST_MASK)

#define NETC_SW_BASE_IMDCR0_IPV_MASK             (0x1CU)
#define NETC_SW_BASE_IMDCR0_IPV_SHIFT            (2U)
#define NETC_SW_BASE_IMDCR0_IPV_WIDTH            (3U)
#define NETC_SW_BASE_IMDCR0_IPV(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_IMDCR0_IPV_SHIFT)) & NETC_SW_BASE_IMDCR0_IPV_MASK)

#define NETC_SW_BASE_IMDCR0_DR_MASK              (0xC0U)
#define NETC_SW_BASE_IMDCR0_DR_SHIFT             (6U)
#define NETC_SW_BASE_IMDCR0_DR_WIDTH             (2U)
#define NETC_SW_BASE_IMDCR0_DR(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_IMDCR0_DR_SHIFT)) & NETC_SW_BASE_IMDCR0_DR_MASK)

