zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_BASE.h
#define NETC_SW_BASE_IMDCR0_PORT_MASK            (0x1F00U)
#define NETC_SW_BASE_IMDCR0_PORT_SHIFT           (8U)
#define NETC_SW_BASE_IMDCR0_PORT_WIDTH           (5U)
#define NETC_SW_BASE_IMDCR0_PORT(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_IMDCR0_PORT_SHIFT)) & NETC_SW_BASE_IMDCR0_PORT_MASK)

#define NETC_SW_BASE_IMDCR0_SWID_MASK            (0xE000U)
#define NETC_SW_BASE_IMDCR0_SWID_SHIFT           (13U)
#define NETC_SW_BASE_IMDCR0_SWID_WIDTH           (3U)
#define NETC_SW_BASE_IMDCR0_SWID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_IMDCR0_SWID_SHIFT)) & NETC_SW_BASE_IMDCR0_SWID_MASK)
/*! @} */

/*! @name IMDCR1 - Ingress mirror destination configuration register 1 */
/*! @{ */

#define NETC_SW_BASE_IMDCR1_EFMEID_MASK          (0xFFFFU)
#define NETC_SW_BASE_IMDCR1_EFMEID_SHIFT         (0U)
#define NETC_SW_BASE_IMDCR1_EFMEID_WIDTH         (16U)
#define NETC_SW_BASE_IMDCR1_EFMEID(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_IMDCR1_EFMEID_SHIFT)) & NETC_SW_BASE_IMDCR1_EFMEID_MASK)

#define NETC_SW_BASE_IMDCR1_EFM_LEN_CHANGE_MASK  (0x7F0000U)
#define NETC_SW_BASE_IMDCR1_EFM_LEN_CHANGE_SHIFT (16U)
#define NETC_SW_BASE_IMDCR1_EFM_LEN_CHANGE_WIDTH (7U)
#define NETC_SW_BASE_IMDCR1_EFM_LEN_CHANGE(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_IMDCR1_EFM_LEN_CHANGE_SHIFT)) & NETC_SW_BASE_IMDCR1_EFM_LEN_CHANGE_MASK)
/*! @} */

/*! @name CTFCR - Cut-through forwarding count register */
/*! @{ */

#define NETC_SW_BASE_CTFCR_COUNT_MASK            (0xFFFFFFFFU)
#define NETC_SW_BASE_CTFCR_COUNT_SHIFT           (0U)
#define NETC_SW_BASE_CTFCR_COUNT_WIDTH           (32U)
#define NETC_SW_BASE_CTFCR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CTFCR_COUNT_SHIFT)) & NETC_SW_BASE_CTFCR_COUNT_MASK)
/*! @} */

/*! @name CBDRMR - Command BDR 0 mode register..Command BDR 1 mode register */
/*! @{ */

#define NETC_SW_BASE_CBDRMR_EN_MASK              (0x80000000U)
#define NETC_SW_BASE_CBDRMR_EN_SHIFT             (31U)
#define NETC_SW_BASE_CBDRMR_EN_WIDTH             (1U)
#define NETC_SW_BASE_CBDRMR_EN(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CBDRMR_EN_SHIFT)) & NETC_SW_BASE_CBDRMR_EN_MASK)
/*! @} */

/*! @name CBDRSR - Command BDR 0 status register..Command BDR 1 status register */
/*! @{ */

#define NETC_SW_BASE_CBDRSR_BUSY_MASK            (0x1U)
#define NETC_SW_BASE_CBDRSR_BUSY_SHIFT           (0U)
#define NETC_SW_BASE_CBDRSR_BUSY_WIDTH           (1U)
#define NETC_SW_BASE_CBDRSR_BUSY(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CBDRSR_BUSY_SHIFT)) & NETC_SW_BASE_CBDRSR_BUSY_MASK)
/*! @} */

/*! @name CBDRBAR0 - Command BDR base address register 0 */
/*! @{ */

#define NETC_SW_BASE_CBDRBAR0_ADDRL_MASK         (0xFFFFFF80U)
#define NETC_SW_BASE_CBDRBAR0_ADDRL_SHIFT        (7U)
#define NETC_SW_BASE_CBDRBAR0_ADDRL_WIDTH        (25U)
#define NETC_SW_BASE_CBDRBAR0_ADDRL(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CBDRBAR0_ADDRL_SHIFT)) & NETC_SW_BASE_CBDRBAR0_ADDRL_MASK)
/*! @} */

/*! @name CBDRBAR1 - Command BDR 0 base address register 1..Command BDR 1 base address register 1 */
/*! @{ */

#define NETC_SW_BASE_CBDRBAR1_ADDRH_MASK         (0xFFFFFFFFU)
#define NETC_SW_BASE_CBDRBAR1_ADDRH_SHIFT        (0U)
#define NETC_SW_BASE_CBDRBAR1_ADDRH_WIDTH        (32U)
#define NETC_SW_BASE_CBDRBAR1_ADDRH(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CBDRBAR1_ADDRH_SHIFT)) & NETC_SW_BASE_CBDRBAR1_ADDRH_MASK)
/*! @} */

/*! @name CBDRPIR - Command BDR 0 producer index register..Command BDR 1 producer index register */
/*! @{ */

#define NETC_SW_BASE_CBDRPIR_BDR_INDEX_MASK      (0x3FFU)
#define NETC_SW_BASE_CBDRPIR_BDR_INDEX_SHIFT     (0U)
#define NETC_SW_BASE_CBDRPIR_BDR_INDEX_WIDTH     (10U)
#define NETC_SW_BASE_CBDRPIR_BDR_INDEX(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CBDRPIR_BDR_INDEX_SHIFT)) & NETC_SW_BASE_CBDRPIR_BDR_INDEX_MASK)
/*! @} */

/*! @name CBDRCIR - Command BDR 0 consumer index register..Command BDR 1 consumer index register */
/*! @{ */

#define NETC_SW_BASE_CBDRCIR_BDR_INDEX_MASK      (0x3FFU)
#define NETC_SW_BASE_CBDRCIR_BDR_INDEX_SHIFT     (0U)
#define NETC_SW_BASE_CBDRCIR_BDR_INDEX_WIDTH     (10U)
#define NETC_SW_BASE_CBDRCIR_BDR_INDEX(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CBDRCIR_BDR_INDEX_SHIFT)) & NETC_SW_BASE_CBDRCIR_BDR_INDEX_MASK)

#define NETC_SW_BASE_CBDRCIR_SBE_MASK            (0x80000000U)
#define NETC_SW_BASE_CBDRCIR_SBE_SHIFT           (31U)
#define NETC_SW_BASE_CBDRCIR_SBE_WIDTH           (1U)
#define NETC_SW_BASE_CBDRCIR_SBE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CBDRCIR_SBE_SHIFT)) & NETC_SW_BASE_CBDRCIR_SBE_MASK)
/*! @} */

/*! @name CBDRLENR - Command BDR 0 length register..Command BDR 1 length register */
/*! @{ */

#define NETC_SW_BASE_CBDRLENR_LENGTH_MASK        (0x7F8U)
#define NETC_SW_BASE_CBDRLENR_LENGTH_SHIFT       (3U)
#define NETC_SW_BASE_CBDRLENR_LENGTH_WIDTH       (8U)
#define NETC_SW_BASE_CBDRLENR_LENGTH(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CBDRLENR_LENGTH_SHIFT)) & NETC_SW_BASE_CBDRLENR_LENGTH_MASK)
/*! @} */

/*! @name CBDRIER - Command BDR 0 interrupt enable register..Command BDR 1 interrupt enable register */
/*! @{ */

#define NETC_SW_BASE_CBDRIER_CBDCIE_MASK         (0x1U)
#define NETC_SW_BASE_CBDRIER_CBDCIE_SHIFT        (0U)
#define NETC_SW_BASE_CBDRIER_CBDCIE_WIDTH        (1U)
#define NETC_SW_BASE_CBDRIER_CBDCIE(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CBDRIER_CBDCIE_SHIFT)) & NETC_SW_BASE_CBDRIER_CBDCIE_MASK)
/*! @} */

/*! @name CBDRIDR - Command BDR 0 interrupt detect register..Command BDR 1 interrupt detect register */
/*! @{ */

#define NETC_SW_BASE_CBDRIDR_CBDC_MASK           (0x1U)
#define NETC_SW_BASE_CBDRIDR_CBDC_SHIFT          (0U)
#define NETC_SW_BASE_CBDRIDR_CBDC_WIDTH          (1U)
#define NETC_SW_BASE_CBDRIDR_CBDC(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CBDRIDR_CBDC_SHIFT)) & NETC_SW_BASE_CBDRIDR_CBDC_MASK)
/*! @} */

/*! @name CBDRMSIVR - Command BDR 0 MSI-X vector register..Command BDR 1 MSI-X vector register */
/*! @{ */

#define NETC_SW_BASE_CBDRMSIVR_VECTOR_MASK       (0xFU)
#define NETC_SW_BASE_CBDRMSIVR_VECTOR_SHIFT      (0U)
#define NETC_SW_BASE_CBDRMSIVR_VECTOR_WIDTH      (4U)
#define NETC_SW_BASE_CBDRMSIVR_VECTOR(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_CBDRMSIVR_VECTOR_SHIFT)) & NETC_SW_BASE_CBDRMSIVR_VECTOR_MASK)
/*! @} */

/*! @name QOSVLANMPR - QoS to VLAN mapping profile 0 register 0..QoS to VLAN mapping profile 1 register 3 */
/*! @{ */

#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR0_MASK    (0xFU)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR0_SHIFT   (0U)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR0_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR0(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV0_DR0_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV0_DR0_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR0_MASK    (0xFU)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR0_SHIFT   (0U)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR0_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR0(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV2_DR0_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV2_DR0_MASK)

