zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_BASE.h
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR0_MASK    (0xFU)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR0_SHIFT   (0U)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR0_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR0(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV4_DR0_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV4_DR0_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR0_MASK    (0xFU)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR0_SHIFT   (0U)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR0_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR0(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV6_DR0_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV6_DR0_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR1_MASK    (0xF0U)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR1_SHIFT   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR1_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR1(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV0_DR1_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV0_DR1_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR1_MASK    (0xF0U)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR1_SHIFT   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR1_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR1(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV2_DR1_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV2_DR1_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR1_MASK    (0xF0U)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR1_SHIFT   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR1_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR1(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV4_DR1_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV4_DR1_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR1_MASK    (0xF0U)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR1_SHIFT   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR1_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR1(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV6_DR1_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV6_DR1_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR2_MASK    (0xF00U)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR2_SHIFT   (8U)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR2_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR2(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV0_DR2_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV0_DR2_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR2_MASK    (0xF00U)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR2_SHIFT   (8U)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR2_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR2(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV2_DR2_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV2_DR2_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR2_MASK    (0xF00U)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR2_SHIFT   (8U)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR2_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR2(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV4_DR2_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV4_DR2_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR2_MASK    (0xF00U)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR2_SHIFT   (8U)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR2_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR2(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV6_DR2_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV6_DR2_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR3_MASK    (0xF000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR3_SHIFT   (12U)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR3_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV0_DR3(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV0_DR3_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV0_DR3_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR3_MASK    (0xF000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR3_SHIFT   (12U)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR3_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV2_DR3(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV2_DR3_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV2_DR3_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR3_MASK    (0xF000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR3_SHIFT   (12U)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR3_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV4_DR3(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV4_DR3_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV4_DR3_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR3_MASK    (0xF000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR3_SHIFT   (12U)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR3_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV6_DR3(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV6_DR3_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV6_DR3_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR0_MASK    (0xF0000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR0_SHIFT   (16U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR0_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR0(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV1_DR0_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV1_DR0_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR0_MASK    (0xF0000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR0_SHIFT   (16U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR0_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR0(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV3_DR0_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV3_DR0_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR0_MASK    (0xF0000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR0_SHIFT   (16U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR0_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR0(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV5_DR0_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV5_DR0_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR0_MASK    (0xF0000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR0_SHIFT   (16U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR0_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR0(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV7_DR0_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV7_DR0_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR1_MASK    (0xF00000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR1_SHIFT   (20U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR1_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR1(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV1_DR1_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV1_DR1_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR1_MASK    (0xF00000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR1_SHIFT   (20U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR1_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR1(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV3_DR1_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV3_DR1_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR1_MASK    (0xF00000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR1_SHIFT   (20U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR1_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR1(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV5_DR1_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV5_DR1_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR1_MASK    (0xF00000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR1_SHIFT   (20U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR1_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR1(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV7_DR1_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV7_DR1_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR2_MASK    (0xF000000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR2_SHIFT   (24U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR2_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR2(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV1_DR2_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV1_DR2_MASK)

