zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_BASE.h
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR2_MASK    (0xF000000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR2_SHIFT   (24U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR2_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR2(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV3_DR2_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV3_DR2_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR2_MASK    (0xF000000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR2_SHIFT   (24U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR2_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR2(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV5_DR2_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV5_DR2_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR2_MASK    (0xF000000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR2_SHIFT   (24U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR2_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR2(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV7_DR2_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV7_DR2_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR3_MASK    (0xF0000000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR3_SHIFT   (28U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR3_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV1_DR3(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV1_DR3_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV1_DR3_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR3_MASK    (0xF0000000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR3_SHIFT   (28U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR3_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV3_DR3(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV3_DR3_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV3_DR3_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR3_MASK    (0xF0000000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR3_SHIFT   (28U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR3_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV5_DR3(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV5_DR3_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV5_DR3_MASK)

#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR3_MASK    (0xF0000000U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR3_SHIFT   (28U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR3_WIDTH   (4U)
#define NETC_SW_BASE_QOSVLANMPR_IPV7_DR3(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_QOSVLANMPR_IPV7_DR3_SHIFT)) & NETC_SW_BASE_QOSVLANMPR_IPV7_DR3_MASK)
/*! @} */

/*! @name PCP2PCPMPR - PCP to PCP mapping profile 0 register..PCP to PCP mapping profile 1 register */
/*! @{ */

#define NETC_SW_BASE_PCP2PCPMPR_PCP0_MASK        (0x7U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP0_SHIFT       (0U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP0_WIDTH       (3U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP0(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_PCP2PCPMPR_PCP0_SHIFT)) & NETC_SW_BASE_PCP2PCPMPR_PCP0_MASK)

#define NETC_SW_BASE_PCP2PCPMPR_PCP1_MASK        (0x70U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP1_SHIFT       (4U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP1_WIDTH       (3U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP1(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_PCP2PCPMPR_PCP1_SHIFT)) & NETC_SW_BASE_PCP2PCPMPR_PCP1_MASK)

#define NETC_SW_BASE_PCP2PCPMPR_PCP2_MASK        (0x700U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP2_SHIFT       (8U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP2_WIDTH       (3U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP2(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_PCP2PCPMPR_PCP2_SHIFT)) & NETC_SW_BASE_PCP2PCPMPR_PCP2_MASK)

#define NETC_SW_BASE_PCP2PCPMPR_PCP3_MASK        (0x7000U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP3_SHIFT       (12U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP3_WIDTH       (3U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP3(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_PCP2PCPMPR_PCP3_SHIFT)) & NETC_SW_BASE_PCP2PCPMPR_PCP3_MASK)

#define NETC_SW_BASE_PCP2PCPMPR_PCP4_MASK        (0x70000U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP4_SHIFT       (16U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP4_WIDTH       (3U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP4(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_PCP2PCPMPR_PCP4_SHIFT)) & NETC_SW_BASE_PCP2PCPMPR_PCP4_MASK)

#define NETC_SW_BASE_PCP2PCPMPR_PCP5_MASK        (0x700000U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP5_SHIFT       (20U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP5_WIDTH       (3U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP5(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_PCP2PCPMPR_PCP5_SHIFT)) & NETC_SW_BASE_PCP2PCPMPR_PCP5_MASK)

#define NETC_SW_BASE_PCP2PCPMPR_PCP6_MASK        (0x7000000U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP6_SHIFT       (24U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP6_WIDTH       (3U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP6(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_PCP2PCPMPR_PCP6_SHIFT)) & NETC_SW_BASE_PCP2PCPMPR_PCP6_MASK)

#define NETC_SW_BASE_PCP2PCPMPR_PCP7_MASK        (0x70000000U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP7_SHIFT       (28U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP7_WIDTH       (3U)
#define NETC_SW_BASE_PCP2PCPMPR_PCP7(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_PCP2PCPMPR_PCP7_SHIFT)) & NETC_SW_BASE_PCP2PCPMPR_PCP7_MASK)
/*! @} */

/*! @name BRCAPR - Bridge capability register */
/*! @{ */

#define NETC_SW_BASE_BRCAPR_IPV4MFLT_MASK        (0x1U)
#define NETC_SW_BASE_BRCAPR_IPV4MFLT_SHIFT       (0U)
#define NETC_SW_BASE_BRCAPR_IPV4MFLT_WIDTH       (1U)
#define NETC_SW_BASE_BRCAPR_IPV4MFLT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_BRCAPR_IPV4MFLT_SHIFT)) & NETC_SW_BASE_BRCAPR_IPV4MFLT_MASK)

#define NETC_SW_BASE_BRCAPR_STAMVD_MASK          (0x4U)
#define NETC_SW_BASE_BRCAPR_STAMVD_SHIFT         (2U)
#define NETC_SW_BASE_BRCAPR_STAMVD_WIDTH         (1U)
#define NETC_SW_BASE_BRCAPR_STAMVD(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_BRCAPR_STAMVD_SHIFT)) & NETC_SW_BASE_BRCAPR_STAMVD_MASK)

#define NETC_SW_BASE_BRCAPR_STRMCTRL_MASK        (0x8U)
#define NETC_SW_BASE_BRCAPR_STRMCTRL_SHIFT       (3U)
#define NETC_SW_BASE_BRCAPR_STRMCTRL_WIDTH       (1U)
#define NETC_SW_BASE_BRCAPR_STRMCTRL(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_BRCAPR_STRMCTRL_SHIFT)) & NETC_SW_BASE_BRCAPR_STRMCTRL_MASK)

