zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_BASE.h
#define NETC_SW_BASE_BRCAPR_SRCPPRND_MASK        (0x10U)
#define NETC_SW_BASE_BRCAPR_SRCPPRND_SHIFT       (4U)
#define NETC_SW_BASE_BRCAPR_SRCPPRND_WIDTH       (1U)
#define NETC_SW_BASE_BRCAPR_SRCPPRND(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_BRCAPR_SRCPPRND_SHIFT)) & NETC_SW_BASE_BRCAPR_SRCPPRND_MASK)

#define NETC_SW_BASE_BRCAPR_EVLANXLATE_MASK      (0x20U)
#define NETC_SW_BASE_BRCAPR_EVLANXLATE_SHIFT     (5U)
#define NETC_SW_BASE_BRCAPR_EVLANXLATE_WIDTH     (1U)
#define NETC_SW_BASE_BRCAPR_EVLANXLATE(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_BRCAPR_EVLANXLATE_SHIFT)) & NETC_SW_BASE_BRCAPR_EVLANXLATE_MASK)

#define NETC_SW_BASE_BRCAPR_NUM_STG_MASK         (0x3000U)
#define NETC_SW_BASE_BRCAPR_NUM_STG_SHIFT        (12U)
#define NETC_SW_BASE_BRCAPR_NUM_STG_WIDTH        (2U)
#define NETC_SW_BASE_BRCAPR_NUM_STG(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_BRCAPR_NUM_STG_SHIFT)) & NETC_SW_BASE_BRCAPR_NUM_STG_MASK)
/*! @} */

/*! @name VFHTCAPR - VLAN filter hash table capability register */
/*! @{ */

#define NETC_SW_BASE_VFHTCAPR_VERSIONS_MASK      (0xFFFF0000U)
#define NETC_SW_BASE_VFHTCAPR_VERSIONS_SHIFT     (16U)
#define NETC_SW_BASE_VFHTCAPR_VERSIONS_WIDTH     (16U)
#define NETC_SW_BASE_VFHTCAPR_VERSIONS(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTCAPR_VERSIONS_SHIFT)) & NETC_SW_BASE_VFHTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name VFHTOR - VLAN filter hash table operational register */
/*! @{ */

#define NETC_SW_BASE_VFHTOR_NUM_ENTRIES_MASK     (0xFFFU)
#define NETC_SW_BASE_VFHTOR_NUM_ENTRIES_SHIFT    (0U)
#define NETC_SW_BASE_VFHTOR_NUM_ENTRIES_WIDTH    (12U)
#define NETC_SW_BASE_VFHTOR_NUM_ENTRIES(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTOR_NUM_ENTRIES_SHIFT)) & NETC_SW_BASE_VFHTOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name VFHTDECR0 - VLAN Filter (hash) table default entry configuration registers 0 */
/*! @{ */

#define NETC_SW_BASE_VFHTDECR0_PORT0_MASK        (0x1U)
#define NETC_SW_BASE_VFHTDECR0_PORT0_SHIFT       (0U)
#define NETC_SW_BASE_VFHTDECR0_PORT0_WIDTH       (1U)
#define NETC_SW_BASE_VFHTDECR0_PORT0(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR0_PORT0_SHIFT)) & NETC_SW_BASE_VFHTDECR0_PORT0_MASK)

#define NETC_SW_BASE_VFHTDECR0_PORT1_MASK        (0x2U)
#define NETC_SW_BASE_VFHTDECR0_PORT1_SHIFT       (1U)
#define NETC_SW_BASE_VFHTDECR0_PORT1_WIDTH       (1U)
#define NETC_SW_BASE_VFHTDECR0_PORT1(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR0_PORT1_SHIFT)) & NETC_SW_BASE_VFHTDECR0_PORT1_MASK)

#define NETC_SW_BASE_VFHTDECR0_PORT2_MASK        (0x4U)
#define NETC_SW_BASE_VFHTDECR0_PORT2_SHIFT       (2U)
#define NETC_SW_BASE_VFHTDECR0_PORT2_WIDTH       (1U)
#define NETC_SW_BASE_VFHTDECR0_PORT2(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR0_PORT2_SHIFT)) & NETC_SW_BASE_VFHTDECR0_PORT2_MASK)

#define NETC_SW_BASE_VFHTDECR0_PORT3_MASK        (0x8U)
#define NETC_SW_BASE_VFHTDECR0_PORT3_SHIFT       (3U)
#define NETC_SW_BASE_VFHTDECR0_PORT3_WIDTH       (1U)
#define NETC_SW_BASE_VFHTDECR0_PORT3(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR0_PORT3_SHIFT)) & NETC_SW_BASE_VFHTDECR0_PORT3_MASK)

#define NETC_SW_BASE_VFHTDECR0_PORT4_MASK        (0x10U)
#define NETC_SW_BASE_VFHTDECR0_PORT4_SHIFT       (4U)
#define NETC_SW_BASE_VFHTDECR0_PORT4_WIDTH       (1U)
#define NETC_SW_BASE_VFHTDECR0_PORT4(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR0_PORT4_SHIFT)) & NETC_SW_BASE_VFHTDECR0_PORT4_MASK)

#define NETC_SW_BASE_VFHTDECR0_PORT5_MASK        (0x20U)
#define NETC_SW_BASE_VFHTDECR0_PORT5_SHIFT       (5U)
#define NETC_SW_BASE_VFHTDECR0_PORT5_WIDTH       (1U)
#define NETC_SW_BASE_VFHTDECR0_PORT5(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR0_PORT5_SHIFT)) & NETC_SW_BASE_VFHTDECR0_PORT5_MASK)

#define NETC_SW_BASE_VFHTDECR0_STG_ID_MASK       (0xF000000U)
#define NETC_SW_BASE_VFHTDECR0_STG_ID_SHIFT      (24U)
#define NETC_SW_BASE_VFHTDECR0_STG_ID_WIDTH      (4U)
#define NETC_SW_BASE_VFHTDECR0_STG_ID(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR0_STG_ID_SHIFT)) & NETC_SW_BASE_VFHTDECR0_STG_ID_MASK)

#define NETC_SW_BASE_VFHTDECR0_IPMFE_MASK        (0x20000000U)
#define NETC_SW_BASE_VFHTDECR0_IPMFE_SHIFT       (29U)
#define NETC_SW_BASE_VFHTDECR0_IPMFE_WIDTH       (1U)
#define NETC_SW_BASE_VFHTDECR0_IPMFE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR0_IPMFE_SHIFT)) & NETC_SW_BASE_VFHTDECR0_IPMFE_MASK)

#define NETC_SW_BASE_VFHTDECR0_IPMFLE_MASK       (0x40000000U)
#define NETC_SW_BASE_VFHTDECR0_IPMFLE_SHIFT      (30U)
#define NETC_SW_BASE_VFHTDECR0_IPMFLE_WIDTH      (1U)
#define NETC_SW_BASE_VFHTDECR0_IPMFLE(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR0_IPMFLE_SHIFT)) & NETC_SW_BASE_VFHTDECR0_IPMFLE_MASK)
/*! @} */

/*! @name VFHTDECR1 - VLAN filter hash table default entry configuration registers 1 */
/*! @{ */

#define NETC_SW_BASE_VFHTDECR1_FID_MASK          (0xFFFU)
#define NETC_SW_BASE_VFHTDECR1_FID_SHIFT         (0U)
#define NETC_SW_BASE_VFHTDECR1_FID_WIDTH         (12U)
#define NETC_SW_BASE_VFHTDECR1_FID(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR1_FID_SHIFT)) & NETC_SW_BASE_VFHTDECR1_FID_MASK)

#define NETC_SW_BASE_VFHTDECR1_VL_MODE_MASK      (0x1000U)
#define NETC_SW_BASE_VFHTDECR1_VL_MODE_SHIFT     (12U)
#define NETC_SW_BASE_VFHTDECR1_VL_MODE_WIDTH     (1U)
#define NETC_SW_BASE_VFHTDECR1_VL_MODE(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR1_VL_MODE_SHIFT)) & NETC_SW_BASE_VFHTDECR1_VL_MODE_MASK)

#define NETC_SW_BASE_VFHTDECR1_PGA_MASK          (0x2000U)
#define NETC_SW_BASE_VFHTDECR1_PGA_SHIFT         (13U)
#define NETC_SW_BASE_VFHTDECR1_PGA_WIDTH         (1U)
#define NETC_SW_BASE_VFHTDECR1_PGA(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR1_PGA_SHIFT)) & NETC_SW_BASE_VFHTDECR1_PGA_MASK)

#define NETC_SW_BASE_VFHTDECR1_ET_EID_MASK       (0xFFFF0000U)
#define NETC_SW_BASE_VFHTDECR1_ET_EID_SHIFT      (16U)
#define NETC_SW_BASE_VFHTDECR1_ET_EID_WIDTH      (16U)
#define NETC_SW_BASE_VFHTDECR1_ET_EID(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR1_ET_EID_SHIFT)) & NETC_SW_BASE_VFHTDECR1_ET_EID_MASK)
/*! @} */

/*! @name VFHTDECR2 - VLAN filter hash table default entry configuration registers 2 */
/*! @{ */

#define NETC_SW_BASE_VFHTDECR2_ETA_PORT0_MASK    (0x1U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT0_SHIFT   (0U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT0_WIDTH   (1U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT0(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR2_ETA_PORT0_SHIFT)) & NETC_SW_BASE_VFHTDECR2_ETA_PORT0_MASK)

#define NETC_SW_BASE_VFHTDECR2_ETA_PORT1_MASK    (0x2U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT1_SHIFT   (1U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT1_WIDTH   (1U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT1(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR2_ETA_PORT1_SHIFT)) & NETC_SW_BASE_VFHTDECR2_ETA_PORT1_MASK)

#define NETC_SW_BASE_VFHTDECR2_ETA_PORT2_MASK    (0x4U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT2_SHIFT   (2U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT2_WIDTH   (1U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT2(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR2_ETA_PORT2_SHIFT)) & NETC_SW_BASE_VFHTDECR2_ETA_PORT2_MASK)

