zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_BASE.h
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT3_MASK    (0x8U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT3_SHIFT   (3U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT3_WIDTH   (1U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT3(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR2_ETA_PORT3_SHIFT)) & NETC_SW_BASE_VFHTDECR2_ETA_PORT3_MASK)

#define NETC_SW_BASE_VFHTDECR2_ETA_PORT4_MASK    (0x10U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT4_SHIFT   (4U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT4_WIDTH   (1U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT4(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR2_ETA_PORT4_SHIFT)) & NETC_SW_BASE_VFHTDECR2_ETA_PORT4_MASK)

#define NETC_SW_BASE_VFHTDECR2_ETA_PORT5_MASK    (0x20U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT5_SHIFT   (5U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT5_WIDTH   (1U)
#define NETC_SW_BASE_VFHTDECR2_ETA_PORT5(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR2_ETA_PORT5_SHIFT)) & NETC_SW_BASE_VFHTDECR2_ETA_PORT5_MASK)

#define NETC_SW_BASE_VFHTDECR2_MLO_MASK          (0x7000000U)
#define NETC_SW_BASE_VFHTDECR2_MLO_SHIFT         (24U)
#define NETC_SW_BASE_VFHTDECR2_MLO_WIDTH         (3U)
#define NETC_SW_BASE_VFHTDECR2_MLO(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR2_MLO_SHIFT)) & NETC_SW_BASE_VFHTDECR2_MLO_MASK)

#define NETC_SW_BASE_VFHTDECR2_MFO_MASK          (0x18000000U)
#define NETC_SW_BASE_VFHTDECR2_MFO_SHIFT         (27U)
#define NETC_SW_BASE_VFHTDECR2_MFO_WIDTH         (2U)
#define NETC_SW_BASE_VFHTDECR2_MFO(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR2_MFO_SHIFT)) & NETC_SW_BASE_VFHTDECR2_MFO_MASK)

#define NETC_SW_BASE_VFHTDECR2_FDBAFSS_MASK      (0x20000000U)
#define NETC_SW_BASE_VFHTDECR2_FDBAFSS_SHIFT     (29U)
#define NETC_SW_BASE_VFHTDECR2_FDBAFSS_WIDTH     (1U)
#define NETC_SW_BASE_VFHTDECR2_FDBAFSS(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_VFHTDECR2_FDBAFSS_SHIFT)) & NETC_SW_BASE_VFHTDECR2_FDBAFSS_MASK)
/*! @} */

/*! @name FDBHTCAPR - FDB hash table capability register */
/*! @{ */

#define NETC_SW_BASE_FDBHTCAPR_NUM_GMAC_MASK     (0x1FFU)
#define NETC_SW_BASE_FDBHTCAPR_NUM_GMAC_SHIFT    (0U)
#define NETC_SW_BASE_FDBHTCAPR_NUM_GMAC_WIDTH    (9U)
#define NETC_SW_BASE_FDBHTCAPR_NUM_GMAC(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_FDBHTCAPR_NUM_GMAC_SHIFT)) & NETC_SW_BASE_FDBHTCAPR_NUM_GMAC_MASK)

#define NETC_SW_BASE_FDBHTCAPR_VERSIONS_MASK     (0xFFFF0000U)
#define NETC_SW_BASE_FDBHTCAPR_VERSIONS_SHIFT    (16U)
#define NETC_SW_BASE_FDBHTCAPR_VERSIONS_WIDTH    (16U)
#define NETC_SW_BASE_FDBHTCAPR_VERSIONS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_FDBHTCAPR_VERSIONS_SHIFT)) & NETC_SW_BASE_FDBHTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name FDBHTMCR - FDB hash table memory configuration register */
/*! @{ */

#define NETC_SW_BASE_FDBHTMCR_DYN_LIMIT_MASK     (0xFFFFU)
#define NETC_SW_BASE_FDBHTMCR_DYN_LIMIT_SHIFT    (0U)
#define NETC_SW_BASE_FDBHTMCR_DYN_LIMIT_WIDTH    (16U)
#define NETC_SW_BASE_FDBHTMCR_DYN_LIMIT(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_FDBHTMCR_DYN_LIMIT_SHIFT)) & NETC_SW_BASE_FDBHTMCR_DYN_LIMIT_MASK)
/*! @} */

/*! @name FDBHTOR0 - FDB hash table operational register 0 */
/*! @{ */

#define NETC_SW_BASE_FDBHTOR0_STATIC_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_BASE_FDBHTOR0_STATIC_ENTRIES_SHIFT (0U)
#define NETC_SW_BASE_FDBHTOR0_STATIC_ENTRIES_WIDTH (16U)
#define NETC_SW_BASE_FDBHTOR0_STATIC_ENTRIES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_FDBHTOR0_STATIC_ENTRIES_SHIFT)) & NETC_SW_BASE_FDBHTOR0_STATIC_ENTRIES_MASK)

#define NETC_SW_BASE_FDBHTOR0_NUM_GENTRIES_MASK  (0x1FF0000U)
#define NETC_SW_BASE_FDBHTOR0_NUM_GENTRIES_SHIFT (16U)
#define NETC_SW_BASE_FDBHTOR0_NUM_GENTRIES_WIDTH (9U)
#define NETC_SW_BASE_FDBHTOR0_NUM_GENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_FDBHTOR0_NUM_GENTRIES_SHIFT)) & NETC_SW_BASE_FDBHTOR0_NUM_GENTRIES_MASK)
/*! @} */

/*! @name FDBHTOR1 - FDB hash table operational register 1 */
/*! @{ */

#define NETC_SW_BASE_FDBHTOR1_DYN_ENTRIES_MASK   (0xFFFFU)
#define NETC_SW_BASE_FDBHTOR1_DYN_ENTRIES_SHIFT  (0U)
#define NETC_SW_BASE_FDBHTOR1_DYN_ENTRIES_WIDTH  (16U)
#define NETC_SW_BASE_FDBHTOR1_DYN_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_FDBHTOR1_DYN_ENTRIES_SHIFT)) & NETC_SW_BASE_FDBHTOR1_DYN_ENTRIES_MASK)

#define NETC_SW_BASE_FDBHTOR1_HWM_DYN_ENTRIES_MASK (0xFFFF0000U)
#define NETC_SW_BASE_FDBHTOR1_HWM_DYN_ENTRIES_SHIFT (16U)
#define NETC_SW_BASE_FDBHTOR1_HWM_DYN_ENTRIES_WIDTH (16U)
#define NETC_SW_BASE_FDBHTOR1_HWM_DYN_ENTRIES(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_FDBHTOR1_HWM_DYN_ENTRIES_SHIFT)) & NETC_SW_BASE_FDBHTOR1_HWM_DYN_ENTRIES_MASK)
/*! @} */

/*! @name IPMFHTCAPR - IP multicast filter hash table capability register */
/*! @{ */

#define NETC_SW_BASE_IPMFHTCAPR_VERSIONS_MASK    (0xFFFF0000U)
#define NETC_SW_BASE_IPMFHTCAPR_VERSIONS_SHIFT   (16U)
#define NETC_SW_BASE_IPMFHTCAPR_VERSIONS_WIDTH   (16U)
#define NETC_SW_BASE_IPMFHTCAPR_VERSIONS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_IPMFHTCAPR_VERSIONS_SHIFT)) & NETC_SW_BASE_IPMFHTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name IPV4MFHTOR - IPv4 multicast filter hash table operation register */
/*! @{ */

#define NETC_SW_BASE_IPV4MFHTOR_ASM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_BASE_IPV4MFHTOR_ASM_ENTRIES_SHIFT (0U)
#define NETC_SW_BASE_IPV4MFHTOR_ASM_ENTRIES_WIDTH (16U)
#define NETC_SW_BASE_IPV4MFHTOR_ASM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_IPV4MFHTOR_ASM_ENTRIES_SHIFT)) & NETC_SW_BASE_IPV4MFHTOR_ASM_ENTRIES_MASK)

#define NETC_SW_BASE_IPV4MFHTOR_SSM_ENTRIES_MASK (0xFFFF0000U)
#define NETC_SW_BASE_IPV4MFHTOR_SSM_ENTRIES_SHIFT (16U)
#define NETC_SW_BASE_IPV4MFHTOR_SSM_ENTRIES_WIDTH (16U)
#define NETC_SW_BASE_IPV4MFHTOR_SSM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_BASE_IPV4MFHTOR_SSM_ENTRIES_SHIFT)) & NETC_SW_BASE_IPV4MFHTOR_SSM_ENTRIES_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group NETC_SW_BASE_Register_Masks */

/*!
 * @}
 */ /* end of group NETC_SW_BASE_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_NETC_SW_BASE_H_) */
